import { Component } from '@angular/core';

@Component({
  imports: [],
  selector: 'app-task3-1',
  styleUrl: './task3-1.css',
  templateUrl: './task3-1.html',
})
export class Task31 {
  text = "Info about object you choose"
  aboutCar = "Найбільша машина у світі — це кар'єрний самоскид БелАЗ-75710, який важить разом із вантажем 810 тонн. Його вантажопідйомність становить рекордні 450 тонн, а за габаритами він порівнянний із триповерховим будинком, маючи довжину понад 20 метрів і висоту понад 8 метрів. Цей гігант приводиться в рух двома потужними дизельними двигунами, які видають загалом 4600 кінських сил."
  aboutPlane = "Найбільшим за масою та довжиною літаком в історії авіації є український Ан-225 «Мрія», створений київським КБ імені Антонова. Попри те, що єдиний льотний екземпляр літака було знищено російськими військами в лютому 2022 року на аеродромі в Гостомелі, його рекорди вантажопідйомності та маси залишаються неперевершеними"
  aboutShip = "Найбільшим кораблем у світі був супертанкер Seawise Giant довжина якого становила майже чотириста шістдесят метрів Цей гігант мав ширину близько сімдесяти метрів та перевозив мільйони барелів нафти Через колосальні розміри судно не могло проходити Панамським або Суецьким каналами Зараз серед пасажирських лайнерів лідером є Icon of the Seas який вміщує тисячі людей Бажаєте дізнатися про пасажирські лайнери чи військові авіаносці"

  ShowAboutCar(){
    this.text = this.aboutCar
  }

  ShowAboutPlane(){
    this.text = this.aboutPlane
  }

  ShowAboutShip(){
    this.text = this.aboutShip
  }
}
